import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import '../../../../core/theming/colors.dart';
import '../../../../core/theming/font_styles.dart';

class PrivacyPolicyForm extends StatelessWidget {
  const PrivacyPolicyForm({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
          backgroundColor: ColorsManager.appBarGreen
      ),
      body: ListView(
        padding: EdgeInsets.symmetric(horizontal: 80.w),
        children: [
          SelectableText(
            "سياسة الخصوصية",
            style: TextStyles.font40green,
            textAlign: TextAlign.center,
          ),
          Padding(
            padding:  EdgeInsets.symmetric(vertical: 24.h),
            child: Text(
              "الخصوصية وبيان سريّة المعلومات: نقدر مخاوفكم واهتمامكم بشأن خصوصية بياناتكم على شبكة الإنترنت. لقد تم إعداد هذه السياسة لمساعدتكم في فهم طبيعة البيانات التي نقوم بتجميعها منكم عند زيارتكم لتطبيقنا على شبكة الإنترنت وكيفية تعاملنا مع هذه البيانات الشخصية",
              style: TextStyles.font23gray,
              textAlign: TextAlign.center,
            ),
          ),
          Text("""1 . التصفح: لم نقم بتصميم هذا السوق من أجل تجميع بياناتك الشخصية من جهاز الكمبيوتر الخاص بك أو من جوالك أثناء تصفحك للسوق، وإنما سيتم فقط استخدام البيانات المقدمة من قبلك بمعرفتك ومحض إرادتك.

 2 . عنوان بروتوكول شبكة الإنترنت (IP): في أي وقت تزور فيه أي موقع انترنت أو منصة بما فيها هذه المنصة, سيقوم السيرفر المضيف بتسجيل عنوان بروتوكول شبكة الإنترنت (IP) الخاص بك , تاريخ ووقت الزيارة ونوع متصفح الإنترنت الذي تستخدمه والعنوان URL الخاص بأي موقع من مواقع الإنترنت التي تقوم بإحالتك إلى هذا الموقع على الشبكة.

3 . الروابط بالمواقع الأخرى على شبكة الإنترنت: قد يشتمل تطبيقنا على روابط بالمواقع الأخرى على شبكة الإنترنت. لا نعتبر مسئولين عن تلك المواقع، يمكنك الاطلاع على سياسات السرية والمحتويات الخاصة بتلك المواقع التي يتم الدخول إليها من خلال أي رابط ضمن هذا التطبيق.

 4 . إفشاء المعلومات: سنحافظ في كافة الأوقات على خصوصية وسرية كافة البيانات الشخصية التي نتحصل عليها. ولن يتم إفشاء هذه المعلومات إلا إذا كان ذلك مطلوباً بموجب أي قانون أو عندما نعتقد بحسن نية أن مثل هذا الإجراء سيكون مطلوباً أو مرغوباً فيه للتماشي مع القانون ، أو للدفاع عن أو حماية حقوق الملكية الخاصة بهذا التطبيق أو الجهات المستفيدة منها.

5 . البيانات اللازمة لتنفيذ المعاملات المطلوبة من قبلك: عندما نحتاج إلى أية بيانات خاصة بك , فإننا سنطلب منك تقديمها بمحض إرادتك. حيث ستساعدنا هذه المعلومات في الاتصال بك وتنفيذ طلباتك حيثما كان ذلك ممكنناً. لن يتم اطلاقاً بيع البيانات المقدمة من قبلك إلى أي طرف ثالث بغرض تسويقها لمصلحته الخاصة دون الحصول على موافقتك المسبقة والمكتوبة ما لم يتم ذلك على أساس أنها ضمن بيانات جماعية تستخدم للأغراض الإحصائية والأبحاث دون اشتمالها على أية بيانات من الممكن استخدامها للتعريف بك.

6 . عند الاتصال بنا سيتم التعامل مع كافة البيانات المقدمة من قبلك على أساس أنها سرية . تتطلب النماذج التي يتم تقديمها مباشرة على الشبكة تقديم البيانات التي ستساعدنا في تحسين موقعنا.سيتم استخدام البيانات التي يتم تقديمها من قبلك في الرد على كافة استفساراتك , ملاحظاتك , أو طلباتك من قبل هذا التطبيق .

7 . إفشاء المعلومات لأي طرف ثالث: لن نقوم ببيع , المتاجرة , تأجير , أو إفشاء أي معلومات لمصلحة طرف ثالث خارج هذا التطبيق .

8 . التعديلات على سياسة سرية وخصوصية المعلومات: نحتفظ بالحق في تعديل بنود وشروط سياسة سرية وخصوصية المعلومات إن لزم الأمر ومتى كان ذلك ملائماً. سيتم تنفيذ التعديلات هنا او على صفحة سياسة الخصوصية الرئيسية وسيتم بصفة مستمرة إخطارك بالبيانات التي حصلنا عليها , وكيف سنستخدمها والجهة التي سنقوم بتزويدها بهذه البيانات.

9 . الاتصال بنا: يمكنكم الاتصال بنا عند الحاجة من خلال الضغط على رابط اتصل بنا المتوفر في روابط التطبيق .

اخيرا إن مخاوفك واهتمامك بشأن سرية وخصوصية البيانات تعتبر مسألة في غاية الأهمية بالنسبة لنا. نحن نأمل أن يتم تحقيق ذلك من خلال هذه السياسة.""",
            style: TextStyles.font22black,
            textAlign: TextAlign.start,
          ),
SizedBox(height: 50.h,)
        ],
      ),
    );
  }
}
