import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:souq_Morhaf/core/theming/colors.dart';
import 'package:souq_Morhaf/core/theming/font_styles.dart';

class UsageForm extends StatelessWidget {
  const UsageForm({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(backgroundColor: ColorsManager.appBarGreen),
      body: ListView(
        padding: EdgeInsets.symmetric(horizontal: 80.w),
        children: [
          SelectableText(
            "اتفاقية الاستخدام",
            style: TextStyles.font40green,
            textAlign: TextAlign.center,
          ),
          Padding(
            padding: EdgeInsets.symmetric(vertical: 30.h),
            child: Text("مقدمة", style: TextStyles.font40greenSemibold),
          ),
          Text(
            "إن اتفاقية الاستخدام هذه وخصوصية الاستخدام ، والشروط والبنود ، وجميع السياسات التي تم نشرها على سوق مرهف وضعت لحماية وحفظ حقوق كل من مؤسسة سوق مرهف لتقنية المعلومات و المستخدم الذي يصل إلى الموقع بتسجيل او من دون تسجيل أو المستهلك المستفيد من المحتوى بتسجيل أو من دون تسجيل",
            style: TextStyles.font22black,
            textAlign: TextAlign.center,
          ),
          Text(
            "تخضع البنود والشروط والأحكام والمنازعات القانونية للقوانين والتشريعات والأنظمة المعمول بها في الجمهوريه العربية السورية.",
            style: TextStyles.font22black,
            textAlign: TextAlign.center,
          ),
          Padding(
            padding: EdgeInsets.symmetric(vertical: 30.h),
            child: Text(
              "لكونك مستخدم أو مستهلك على سوق مرهف فأنك توافق على الالتزام بكل ما يرد بهذه الاتفاقية بمجرد استخدامك للمنصة أو في حال الوصول إليها أو في حالة التسجيل في الخدمة. كما يحق لسوق مرهف التعديل على هذه الاتفاقية في أي وقت وتعتبر ملزمة لجميع الأطراف بعد الإعلان عن التحديث في التطبيق",
              style: TextStyles.font22black,
              textAlign: TextAlign.center,
            ),
          ),
          Padding(
            padding: EdgeInsets.symmetric(vertical: 30.h),
            child: Text(
              "المادة الأولي : تعريف",
              style: TextStyles.font22greenSemibold,
            ),
          ),
          Text("1 . سوق مرهف: ", style: TextStyles.font26blackSemibold),
          Text(
            "هو سوق إلكترونى يتيح للمستخدمين فتح حساب لنشر المحتوى الخاص به وفق الأنظمة والتشريعات، ويشار إليها بهذه الاتفاقية باسم مؤسسة سوق مرهف لتقنية المعلومات (الجهة المالكة لسوق مرهف)أو الطرف الأول",
            style: TextStyles.font14black,
            textAlign: TextAlign.center,
          ),
          SizedBox(height: 50.h),
          Text("  2 .المستخدم:", style: TextStyles.font26blackSemibold),
          Text(
            "هو منشئ الحساب على سوق مرهف لغرض التواصل أو التصفح أو نشر المحتوى أو لإنشاء محل إلكتروني كموفر خدمة لممارسة التجارة الإلكترونية على سوق مرهف، ويشار إليه في هذه الاتفاقية بالعضو أو الممارس أو موفر الخدمة أو الطرف الثاني.",
            style: TextStyles.font14black,
            textAlign: TextAlign.center,
          ),
          SizedBox(height: 50.h),
          Text(" 3.المحل الإلكتروني : ", style: TextStyles.font26blackSemibold),
          Text(
            "هو منشئ الحساب على سوق مرهف لغرض التواصل أو التصفح أو نشر المحتوى أو لإنشاء محل إلكتروني كموفر خدمة لممارسة التجارة الإلكترونية على سوق مرهف، ويشار إليه في هذه الاتفاقية بالعضو أو الممارس أو موفر الخدمة أو الطرف الثاني.",
            style: TextStyles.font14black,
            textAlign: TextAlign.center,
          ),
          SizedBox(height: 50.h),
          Padding(
            padding: EdgeInsets.symmetric(vertical: 30.h),
            child: Text(
              "المادة الثانية : شروط الاستخدام",
              style: TextStyles.font22greenSemibold,
            ),
          ),
          Text(
            """بصفتك طرف ثاني في هذه الاتفاقية ولكونك مستفيد من خدمات سوق مرهف فعليك الالتزام بالتالي:

1 . عدم الإعلان أو تحميل محتوى أو عناصر غير ملائمة للتصنيفات المتاحة في المنصة والمسموح ببيعها ومراجعة شروط الإعلان والسلع الممنوعة قبل الإعلان.

2 . عدم الإختراق أو التحايل على قوانين وسياسة وأنظمة المنصة أو أي حقوق تتعلق بطرف ثالث.

3 . عدم نسخ الإعلان من سوق مرهف وإعادة نشرها في مواقع أخرى.

4 . عدم استخدام أي وسيلة غير شرعية للوصول للإعلانات أو بيانات المستخدمين الآخرين أو انتهاك لسياسة وحقوق مؤسسة سوق مرهف لتقنية المعلومات أو الوصول لمحتوى المنصة أو تجميع وتحصيل معلومات وبيانات تخص سوق مرهف أو عملاءها والاستفادة منها بأي شكل من الأشكال أو إعادة نشرها.

5 . عدم استخدام خدماتنا إذا كنت غير مؤهل قانونيا لإتمام هذه الاتفاقية. عدم التلاعب بأسعار السلع سواء في البيع او الشراء وإلحاق الضرر بالمستهلكين الآخرين.

6 . عدم تضمين الإعلان عرضاً أو بياناً أو ادعاء كاذباً أو مصوغاً بعبارات من شأنها أن تؤدي بصورة مباشرة أو غير مباشرة إلى خداع المستهلك أو تضليله، أو القذف، أو التشهير.

7 . عدم التعرض للسياسات، أو السيادات الدولية، أو الشخصيات المعتبرة، أو أي مناقشات غير مشروعة في مؤسسة سوق مرهف لتقنية المعلومات.

8 . عدم نقل حسابك أو نشاطك إلى مواقع أخرى بالوقت الذي هو يحمل شعار أو خدمات المؤسسة.

9 . عدم انتهاك حقوق الملكية الفكرية لمؤسسة سوق مرهف لتقنية المعلومات، بما في ذلك من حقوق الطبع والنشر والعلامات التجارية، وبراءات الاختراع، والدعاية وقواعد البيانات أو غيرها من حقوق الملكية الفكرية التي تنتمي للمؤسسة أو المرخصة لمؤسسة سوق مرهف لتقنية المعلومات.

10 . عدم تضمين الإعلان شعاراً أو علامة تجارية لا تملك حق استعمالها، أو علامة مقلدة وكل ما فيه انتهاك حقوق الملكية الفكرية للآخرين أو براءة الاختراع.

11 . عدم الإعلان عن منتجات التبغ والدخان (هذه السلع تعرضك للمخالفة من قبل الجهات المختصة) وعدم انتهاك أنظمة حقوق الإنسان والمتاجرة بالأشخاص بأي شكل من الأشكال والالتزام بضوابط الإعلان عن تقديم الخدمات العمالية.

12 . الالتزام بضوابط الإعلان العقاري التي حددتها الهيئة العامة للعقار. ويجب الحصول على ترخيص من وزارة السياحة لتقديم أي عروض أو منتجات سياحية.

13 . يجب الالتزام بالضوابط والتراخيص الصادرة من المركز الوطني لحماية الحياة الفطرية.

14 . عدم جمع أو استعمال بيانات مستخدمي الموقع الشخصية أو اتصالاته الإلكترونية لأغراض غير مصرح لها أو مسموح بها، أو الإفصاح عنها لجهة أخرى، بمقابل أو بدون مقابل، إلا بموافقة من تتعلق به البيانات الشخصية أو إذا اقتضت الأنظمة ذلك.

15 . يجب الحصول على ترخيص من الهيئة السورية للمهندسين للعروض الخاضعة لنظام الهيئة.

16 . عدم الإقدام على أي ما من شأنه إلحاق الضرر بسمعة مؤسسة سوق مرهف لتقنية المعلومات بأي شكل كان سواء كان ذلك في المنصة نفسها أو على منصات التواصل الاجتماعي الأخرى وتحتفظ المؤسسة بحقها في الرجوع عليك بكافة الأضرار المترتبة جراء ذلك.

17 . عدم انتحال صفة مؤسسة سوق مرهف لتقنية المعلومات أو ممثل لها أو موظف فيها أو أي صفة توحي بأنك تابع للمؤسسة ما لم يكون لديك إذن رسمي من المؤسسة.

18 . يُمنع استخدام هذه الخدمة من قِبل أي مستخدم غير بشري ويستثنى من ذلك المستخدمين غير البشريين التابعين للشركات التالية فقط:
Google
Facebook
Twitter

إن عدم التزامك بتلك الشروط يمنح مؤسسة سوق مرهف لتقنية المعلومات الحق بحجب عضويتك وإحالة مخالفتك للجهات المختصة بتوقيع العقوبات عند الحاجة ومنعك من الوصول للمنصة وإضافة رقم هاتفك في قائمة الحسابات والأرقام الموقوفة دون أدنى مسؤولية ودون الحاجة لإخطارك بذلك ولا يحق لك الاعتراض وأنت هنا تتعهد بعدم العودة لاستخدام المنصة إلا بعد موافقة المنصة على ذلك.""",
            style: TextStyles.font14black,
            textAlign: TextAlign.center,
          ),
          Padding(
            padding: EdgeInsets.symmetric(vertical: 30.h),
            child: Text(
              "المادة الثالثة : المسئولية",
              style: TextStyles.font22greenSemibold,
            ),
          ),
          Text(
            """1 . تقدم مؤسسة سوق مرهف لتقنية المعلومات خدمة تمكين المستخدم من عرض سلعته ونشر المحتوى وفق سياسة الاستخدام المتفق عليها ولا تقدم أي ضمانات ولا تتحمل أي مسؤولية في حالة عدم التزام المستخدم أو المستهلك بها.

2 . تخلي سوق مرهف مسؤوليتها من أي مخاطرة أو أضرار أو تبعات أو خسائر تقع على البائع أو المشتري أو أي طرف آخر، وعلى من لحق به الضرر زيارة رابط اتصل بنا وشرح الضرر الواقع عليه وستقوم المؤسسة باتخاذ الإجراء حسب نوع الواقعة دون أدنى مسؤولية.

3 . باستخدامك لسوق مرهف يعني أنك تقر بتحمل كامل المسؤولية في التأكد من اتباع جميع القوانين، واللوائح، والأنظمة ذات الصلة عند استخدام المنصة. كما تتحمل مسؤولية إدارة جميع عمليات الشراء وعمليات التسليم في حال كان الحساب محل إلكتروني، وحل المشكلات والنزاعات الناشئة عن محتوى الإعلان مسؤولية كاملة.

4 . باستخدامك لسوق مرهف يعني أنك تخول للمنصة حفظ البيانات والمعلومات الشخصية وغير الشخصية التي قمت بإدخالها بخوادم المؤسسة ولنا حق الإطلاع عليها ومراجعتها.

5 . باستخدامك لسوق مرهف فإنك تقر بأحقية المنصة في مراقبة الرسائل الخاصة عند الحاجة لضمان خلوها من مخالفات اتفاقية الاستخدام ولنا الحق في حذف الإعلان والتصرف بالصور المرفقة عند الحاجة لذلك.

6 . تعتبر تعاميم وقرارات وتوجيهات إدارة ومشرفي السوق ملزمة للطرف الثاني بعد إيصالها له عبر الرسائل الخاصة بالموقع أو الجوال أو البريد الإلكتروني أو عبر نظام الإشعارات، وعليه الالتزام بها والعمل بموجبها.

7 . باستخدامك للمنصة فإنك تقر بأحقية سوق مرهف في حال مخالفتك للأنظمة والقوانين المتبعة في الجمهوريه السورية+ أو لسياسات وقوانين سوق مرهف فإن لمؤسسة سوق مرهف الحق بالرجوع عليك بكافة الأضرار والخسائر وتحميلك أتعاب المحاماة والتعويض عنها.""",
            style: TextStyles.font14black,
            textAlign: TextAlign.center,
          ),
        ],
      ),
    );
  }
}
